hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
#include "indicator_sensor.h"
#include "driver/uart.h"
#include "cobs.h"
#include "esp_timer.h"
#include "nvs.h"
#include<stdlib.h>
#include "time.h"
#include "history.h"
#include "ESP32_RP2040_Comm.h"

#define SENSOR_HISTORY_DATA_DEBUG  0

uint8_t erc_buf[BUF_SIZE];   //recv 
uint8_t erc_data[BUF_SIZE];  //decode

struct sensor_present_data
{
    float latest_value;
    float average;
    float sum;
    int per_hour_cnt;
    //time_t hour_timestamp;

    float  day_min;
    float  day_max;
    //time_t day_timestamp;
    int    per_day_cnt;
};
struct sensor_history_data
{
    struct sensor_data_average data_day[DAY_MAX];
    struct sensor_data_minmax data_week[WEEK_MAX];
};

struct indicator_sensor_present_data
{
    struct sensor_present_data temp;
    struct sensor_present_data humidity;
    struct sensor_present_data co2;
    struct sensor_present_data tvoc;
    struct sensor_present_data pa;
};


struct indicator_sensor_history_data
{
    struct sensor_history_data temp;
    struct sensor_history_data humidity;
    struct sensor_history_data co2;
    struct sensor_history_data tvoc;
    struct sensor_history_data pa;
};

struct updata_queue_msg
{
    uint8_t flag; //1  day data, 2 week data
    time_t  time;
};

#define SENSOR_HISTORY_DATA_STORAGE  "sensor-data"

static const char *TAG = "sensor-model";

static SemaphoreHandle_t       __g_data_mutex;

static int __cmd_send(uint8_t cmd, void *p_data, uint8_t len);

static struct indicator_sensor_history_data  __g_sensor_history_data;
static struct indicator_sensor_present_data  __g_sensor_present_data;

static esp_timer_handle_t   sensor_history_data_timer_handle;

static QueueHandle_t updata_queue_handle = NULL;

static void __sensor_history_data_get( struct sensor_history_data  *p_history, struct view_data_sensor_history_data *p_data)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    
    struct sensor_data_average *p_data_day = &p_history->data_day[0];
    struct sensor_data_minmax  *p_data_week = &p_history->data_week[0];

    memcpy(p_data->data_day, (uint8_t *)p_data_day, sizeof( struct sensor_data_average) * DAY_MAX);
    memcpy(p_data->data_week, (uint8_t *)p_data_week, sizeof( struct sensor_data_minmax) * 7);
    

    //calculate max and min 
    float min=10000;
    float max=-10000;

    for(int i =0; i < DAY_MAX; i++ ) {
        struct sensor_data_average *p_item = p_data_day + i;
        if( p_item->valid ) {
            if( min > p_item->data ){
                min = p_item->data;
            }
            if( max < p_item->data ){
                max = p_item->data;
            }
        }   
    }
    p_data->day_max = max;
    p_data->day_min = min;

    min=10000;
    max=-10000;

    for(int i =0; i < 7; i++ ) {
        struct sensor_data_minmax *p_item = p_data_week + i;
        if( p_item->valid ) {
            if( min > p_item->min ){
                min = p_item->min;
            }
            if( max < p_item->max ){
                max = p_item->max;
            }
        }
    }

    if ( max < min) {
        max=4;
        min=0;
    }

    p_data->week_max = max;
    p_data->week_min = min;

    xSemaphoreGive(__g_data_mutex);
}

static void __sensor_history_data_save(void)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    esp_err_t ret = 0;
    ret = indicator_storage_write(SENSOR_HISTORY_DATA_STORAGE, (void *)&__g_sensor_history_data, sizeof(struct indicator_sensor_history_data));
    xSemaphoreGive(__g_data_mutex);

    if( ret != ESP_OK ) {
        ESP_LOGI(TAG, "sensor history data save err:%d", ret);
    } else {
        ESP_LOGI(TAG, "sensor history data save successful");
    }   
}

static void __sensor_history_data_day_check(struct sensor_data_average p_data_day[], const char *p_sensor_name, time_t now)
{
    //check history data day
    int history_hour =0;
    int cur_hour = 0;

    history_hour =p_data_day[DAY_MAX-1].timestamp/SECOND_ADJUST;
    cur_hour = now/SECOND_ADJUST;

    for( int i =0;  i < DAY_MAX; i++) {
        if( p_data_day[i].valid) {
            ESP_LOGI(TAG, "%s index:%d, data:%.0f, time:%d", p_sensor_name, i, p_data_day[i].data, p_data_day[i].timestamp);
        }
    }

    if( history_hour  >  cur_hour) {
        ESP_LOGI(TAG, "%s History day data pull ahead, clear data", p_sensor_name);
        memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
        return;
    }

    for(int i =0; i < DAY_MAX-1; i++ ) {
       int hour1 =p_data_day[i].timestamp/SECOND_ADJUST;
       int hour2 =p_data_day[i+1].timestamp/SECOND_ADJUST;
       if( (hour2-hour1) != 1) {
            ESP_LOGI(TAG, "%s History day data error, clear data", p_sensor_name);
            memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
            return;
       }
    }

    if( history_hour == cur_hour) {
        ESP_LOGI(TAG, "%s History day data valid", p_sensor_name);
        return;
    }

    if( history_hour < ( cur_hour -(DAY_MAX-1)) ) {
        ESP_LOGI(TAG, "%s History day data expired, clear data!", p_sensor_name);
        memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
    } else {

        int overlap_cnt = history_hour - ( cur_hour -(DAY_MAX-1))+1;

        ESP_LOGI(TAG, "%s History day data  %d overlap !", p_sensor_name, overlap_cnt);

        for(int i =0; i < DAY_MAX; i++ ) {
            if( i < overlap_cnt) {
                p_data_day[i].data = p_data_day[DAY_MAX-overlap_cnt+i].data;
                p_data_day[i].valid = p_data_day[DAY_MAX-overlap_cnt+i].valid;
                p_data_day[i].timestamp = p_data_day[DAY_MAX-overlap_cnt+i].timestamp;
            } else {
                p_data_day[i].data = 0;
                p_data_day[i].valid = false;
                p_data_day[i].timestamp = now - ((DAY_MAX-1) -i) * SECOND_ADJUST;;
            }
        }
    }
}
static void __sensor_history_data_week_check(struct sensor_data_minmax p_data_week[], const char *p_sensor_name, time_t now)
{
    //check history data week
    int history_day =0;
    int cur_day = 0;

    history_day =p_data_week[6].timestamp/ (SECOND_ADJUST * DAY_MAX);
    cur_day = now/ (SECOND_ADJUST * DAY_MAX);

    for( int i =0;  i < 7; i++) {
        if( p_data_week[i].valid) {
            ESP_LOGI(TAG, "%s, index:%d, min:%.0f, max:%.0f, time:%d", p_sensor_name, i, p_data_week[i].min, p_data_week[i].max , p_data_week[i].timestamp);
        }
    }

    if( history_day  >  cur_day){
        ESP_LOGI(TAG, "%s History week data pull ahead, clear data", p_sensor_name);
        memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);
        return;
    }


    for(int i =0; i < 6; i++ ) {
       int  day1 =p_data_week[i].timestamp/ (SECOND_ADJUST * DAY_MAX);
       int  day2 =p_data_week[i+1].timestamp/ (SECOND_ADJUST * DAY_MAX);
       if( (day2-day1) != 1) {
            ESP_LOGI(TAG, "%s History week data error, clear data", p_sensor_name);
            memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);
            return;
       }
    }

    if( history_day  == cur_day){
        ESP_LOGI(TAG, "%s History week data valid", p_sensor_name);
        return;
    }

    if( history_day < ( cur_day -6) ) {
        ESP_LOGI(TAG, "%s History week data expired, clear data!", p_sensor_name);
        memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);

    } else {

        int overlap_cnt = history_day - ( cur_day -6)+1;

        ESP_LOGI(TAG, "%s History week data , %d overlap!", p_sensor_name, overlap_cnt);

        for(int i =0; i < 7; i++ ) {
            if( i < overlap_cnt) {
                p_data_week[i].max = p_data_week[7-overlap_cnt+i].max;
                p_data_week[i].min = p_data_week[7-overlap_cnt+i].min;
                p_data_week[i].timestamp = p_data_week[7-overlap_cnt+i].timestamp;
                p_data_week[i].valid = p_data_week[7-overlap_cnt+i].valid;
            } else {

                p_data_week[i].max = 0;
                p_data_week[i].min = 0;
                p_data_week[i].timestamp = now - (6 -i) * (SECOND_ADJUST * DAY_MAX);
                p_data_week[i].valid = false;
            }
        }
    }
}
static void __sensor_history_data_day_insert(struct sensor_data_average p_data_day[],  struct sensor_present_data  *p_cur,  time_t now)
{
    int history_hour =0;
    int cur_hour = 0;
    struct tm timeinfo;

    localtime_r( &now, &timeinfo);
    //cur_hour = timeinfo.tm_hour;
    cur_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
    
