hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA, \
                           &data, sizeof(struct view_data_sensor_data ), portMAX_DELAY);
            break; 
        } 
        
        case PKT_TYPE_SENSOR_SHT41_TEMP: {
            struct view_data_sensor_data data;
            if( len < (sizeof(data.vaule) +1)) {
                break;
            }
    
            data.sensor_type = SENSOR_DATA_TEMP;
            memcpy(&data.vaule, &p_data[1], sizeof(data.vaule));
            __sensor_present_data_update(&__g_sensor_present_data.temp, data.vaule);

            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA, \
                           &data, sizeof(struct view_data_sensor_data ), portMAX_DELAY);
            break;
        } 

        case PKT_TYPE_SENSOR_SHT41_HUMIDITY: {
            struct view_data_sensor_data data;
            if( len < (sizeof(data.vaule) +1)) {
                break;
            }
        
            data.sensor_type = SENSOR_DATA_HUMIDITY;
            memcpy(&data.vaule, &p_data[1], sizeof(data.vaule));
            __sensor_present_data_update(&__g_sensor_present_data.humidity, data.vaule);

            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA, \
                           &data, sizeof(struct view_data_sensor_data ), portMAX_DELAY);
            break;
        } 

        case PKT_TYPE_SENSOR_TVOC_INDEX: {
            struct view_data_sensor_data data;
            if( len < (sizeof(data.vaule) +1)) {
                break;
            }
    
            data.sensor_type = SENSOR_DATA_TVOC;
            memcpy(&data.vaule, &p_data[1], sizeof(data.vaule));
            __sensor_present_data_update(&__g_sensor_present_data.tvoc, data.vaule);

            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA, \
                           &data, sizeof(struct view_data_sensor_data ), portMAX_DELAY);
            break; 
        } 
        case PKT_TYPE_SENSOR_DPS310_PA: {
            struct view_data_sensor_data data;
            if( len < (sizeof(data.vaule) +1)) {
                break;
            }
    
            data.sensor_type = SENSOR_DATA_PA;
            memcpy(&data.vaule, &p_data[1], sizeof(data.vaule));
            __sensor_present_data_update_pa(&__g_sensor_present_data.pa, data.vaule);

            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA, \
                           &data, sizeof(struct view_data_sensor_data ), portMAX_DELAY);
            break; 
        } 

        default:
            break;
    }

}

static int __cmd_send(uint8_t cmd, void *p_data, uint8_t len)
{
    uint8_t buf[32] = {0};
    uint8_t data[32] = {0};

    if( len > 31) {
        return -1;
    }
    
    uint8_t index =1;

    data[0] = cmd;

    if( len > 0 && p_data != NULL) {
        memcpy(&data[1], p_data, len);
        index += len;
    }
    cobs_encode_result ret = cobs_encode(buf, sizeof(buf),  data, index);
#if 1//SENSOR_COMM_DEBUG
    ESP_LOGI(TAG, "encode status:%d, len:%d",  ret.status,  ret.out_len);
    for(int i=0; i < ret.out_len; i++ ) {
        printf( "0x%x ", buf[i] );
    }
    printf("\r\n");
#endif

    if( ret.status == COBS_ENCODE_OK ) {
        return uart_write_bytes(ESP32_COMM_PORT_NUM,  buf, ret.out_len+1);
    }
    return -1;
}

static void esp32_rp2040_comm_task(void *arg)
{
    uart_config_t uart_config = {
        .baud_rate = ESP32_COMM_BAUD_RATE,
        .data_bits = UART_DATA_8_BITS,
        .parity    = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };
    int intr_alloc_flags = 0;

    ESP_ERROR_CHECK(uart_driver_install(ESP32_COMM_PORT_NUM, BUF_SIZE * 2, 0, 0, NULL, intr_alloc_flags));
    ESP_ERROR_CHECK(uart_param_config(ESP32_COMM_PORT_NUM, &uart_config));
    ESP_ERROR_CHECK(uart_set_pin(ESP32_COMM_PORT_NUM, ESP32_RP2040_TXD, ESP32_RP2040_RXD, ESP32_RP2040_RTS, ESP32_RP2040_CTS));

    __cmd_send(PKT_TYPE_CMD_POWER_ON, NULL, 0);
    cobs_decode_result ret;
    
    while (1) {
        int len = uart_read_bytes(ESP32_COMM_PORT_NUM, erc_buf, (BUF_SIZE - 1), 1 / portTICK_PERIOD_MS);
#if SENSOR_COMM_DEBUG
        ESP_LOGI(TAG, "len:%d",  len);
#endif 
        int index  = 0;
        uint8_t *p_buf_start =  erc_buf;
        uint8_t *p_buf_end = erc_buf;
        if( len > 0 ) {

#if SENSOR_COMM_DEBUG
            printf("recv:  ");
            for(int i=0; i < len; i++ ) {
                printf( "0x%x ", erc_buf[i] );
            }
            printf("\r\n");
#endif 
            while ( p_buf_start < (erc_buf + len)) {
                uint8_t *p_buf_end = p_buf_start;
                while( p_buf_end < (erc_buf + len) ) {
                    if( *p_buf_end == 0x00) {
                        break;
                    }
                    p_buf_end++;
                }
                // decode buf 
                memset(erc_data, 0, sizeof(erc_data));
                ret = cobs_decode(erc_data, sizeof(erc_data),  p_buf_start, p_buf_end - p_buf_start);

#if SENSOR_COMM_DEBUG
                ESP_LOGI(TAG, "decode status:%d, len:%d, type:0x%x  ",  ret.status,  ret.out_len, erc_data[0]);
                printf("decode: ");
                for(int i=0; i < ret.out_len; i++ ) {
                    printf( "0x%x ", erc_data[i] );
                }
                printf("\r\n");
#endif 
                if( ret.out_len > 1  &&  ret.status == COBS_DECODE_OK ) { //todo  ret.status
                    __data_parse_handle((uint8_t *)erc_data, ret.out_len);
                }

                p_buf_start = p_buf_end + 1; // next message
            }
        }
    }
}

static void __sensor_shutdown(void)
{
    int ret = 0;
    ret = __cmd_send(PKT_TYPE_CMD_SHUTDOWN, NULL, 0);
    if( ret <= 0) {
        ESP_LOGI(TAG, "sensor shutdown fail!. %d", ret);
    }
}

static void __view_event_handler(void* handler_args, esp_event_base_t base, int32_t id, void* event_data)
{
    int i;
    switch (id)
    {
        case VIEW_EVENT_SENSOR_TEMP_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_TEMP_HISTORY");
            struct view_data_sensor_history_data data;
            __sensor_history_data_get( &__g_sensor_history_data.temp,  &data);
            data.sensor_type = SENSOR_DATA_TEMP;
            data.resolution  = 1;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }

