hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
        case VIEW_EVENT_SENSOR_HUMIDITY_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_HUMIDITY_HISTORY");
            struct view_data_sensor_history_data data;
            __sensor_history_data_get( &__g_sensor_history_data.humidity,  &data);
            data.sensor_type = SENSOR_DATA_HUMIDITY;
            data.resolution  = 0;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_CO2_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_CO2_HISTORY");
            struct view_data_sensor_history_data data;
            __sensor_history_data_get( &__g_sensor_history_data.co2,  &data);
            data.sensor_type = SENSOR_DATA_CO2;
            data.resolution  = 0;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_TVOC_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_TVOC_HISTORY");
            struct view_data_sensor_history_data data;
            __sensor_history_data_get( &__g_sensor_history_data.tvoc,  &data);
            data.sensor_type = SENSOR_DATA_TVOC;
            data.resolution  = 0;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_PA_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_PA_HISTORY");
            struct view_data_sensor_history_data data;
            __sensor_history_data_get( &__g_sensor_history_data.pa,  &data);
            data.sensor_type = SENSOR_DATA_PA;
            data.resolution  = 0;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }

        case VIEW_EVENT_SHUTDOWN: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SHUTDOWN");
            __sensor_shutdown();
            break;
        }
#if 0
        case VIEW_EVENT_SENDMAIL: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENDMAIL");
            //__sensor_shutdown();
            break;
        }
#endif
//debug ui 
#if 0
        case VIEW_EVENT_SENSOR_TEMP_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_TEMP_HISTORY");
            struct view_data_sensor_history_data data;
            data.sensor_type = SENSOR_DATA_TEMP;
            data.resolution = 1;

            //test
            float min=100;
            float max=0;
            
            time_t now = 0;
            time(&now);
            time_t time1 = (time_t)(now / 3600) * 3600;
            time_t time2 = (time_t)(now / 3600 / 24) * 3600 * 24;
            
            for(i = 0; i < 24; i++) { 
                data.data_day[i].data = (float)lv_rand(10, 40);
                data.data_day[i].timestamp = time1 + i *3600;
                data.data_day[i].valid = true;

                if( min > data.data_day[i].data) {
                    min = data.data_day[i].data;
                }
                if( max < data.data_day[i].data) {
                    max = data.data_day[i].data;
                }
            }
            data.day_max = max;
            data.day_min = min;

            min=100;
            max=0;

            for(i = 0; i < 7; i++) { 
                data.data_week[i].min = (float)lv_rand(10, 20);
                data.data_week[i].max = (float)lv_rand(20, 40);
                data.data_week[i].timestamp =  time2 + i * 3600 * 24;;
                data.data_week[i].valid = true;
                
                if( min > data.data_week[i].min) {
                    min = data.data_week[i].min;
                }
                if( max < data.data_week[i].max) {
                    max = data.data_week[i].max;
                }
            }
            data.week_max = max;
            data.week_min = min;

            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_HUMIDITY_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_HUMIDITY_HISTORY");
            struct view_data_sensor_history_data data;
            data.sensor_type = SENSOR_DATA_HUMIDITY;
            data.resolution = 0;

            //test
            float min=100;
            float max=0;

            time_t now = 0;
            time(&now);
            time_t time1 = (time_t)(now / 3600) * 3600;
            time_t time2 = (time_t)(now / 3600 / 24) * 3600 * 24;
            
            for(i = 0; i < 24; i++) { 
                data.data_day[i].data = (float)lv_rand(30, 50);
                data.data_day[i].timestamp = time1 + i *3600;
                data.data_day[i].valid = true;
                if( min > data.data_day[i].data) {
                    min = data.data_day[i].data;
                }
                if( max < data.data_day[i].data) {
                    max = data.data_day[i].data;
                }
            }
            data.day_max = max;
            data.day_min = min;

            min=100;
            max=0;
            for(i = 0; i < 7; i++) { 
                data.data_week[i].max = (float)lv_rand(40, 50);
                data.data_week[i].min = (float)lv_rand(30, 40);
                data.data_week[i].timestamp =  time2 + i * 3600 * 24;;
                data.data_week[i].valid = true;
                if( min > data.data_week[i].min) {
                    min = data.data_week[i].min;
                }
                if( max < data.data_week[i].max) {
                    max = data.data_week[i].max;
                }
            }
            data.week_max = max;
            data.week_min = min;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_TVOC_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_TVOC_HISTORY");
            struct view_data_sensor_history_data data;
            data.sensor_type = SENSOR_DATA_TVOC;
            data.resolution = 0;

            //test
            float min=120;
            float max=0;

            time_t now = 0;
            time(&now);
            time_t time1 = (time_t)(now / 3600) * 3600;
            time_t time2 = (time_t)(now / 3600 / 24) * 3600 * 24;
            
            for(i = 0; i < 24; i++) { 
                data.data_day[i].data = (float)lv_rand(100, 120);
                data.data_day[i].timestamp = time1 + i *3600;
                data.data_day[i].valid = true;
                if( min > data.data_day[i].data) {
                    min = data.data_day[i].data;
                }
                if( max < data.data_day[i].data) {
                    max = data.data_day[i].data;
                }
            }
            data.day_max = max;
            data.day_min = min;

            min=120;
            max=0;
            for(i = 0; i < 7; i++) { 
                data.data_week[i].max = (float)lv_rand(100, 120);
                data.data_week[i].min = (float)lv_rand(0, 100);
                data.data_week[i].timestamp =  time2 + i * 3600 * 24;;
                data.data_week[i].valid = true;
                if( min > data.data_week[i].min) {
                    min = data.data_week[i].min;
                }
                if( max < data.data_week[i].max) {
                    max = data.data_week[i].max;
                }
            }
            data.week_max = max;
            data.week_min = min;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
        case VIEW_EVENT_SENSOR_CO2_HISTORY: {
            ESP_LOGI(TAG, "event: VIEW_EVENT_SENSOR_CO2_HISTORY");
            struct view_data_sensor_history_data data;
            data.sensor_type = SENSOR_DATA_CO2;
            data.resolution = 0;

            //test
            float min=700;
            float max=0;

            time_t now = 0;
            time(&now);
            time_t time1 = (time_t)(now / 3600) * 3600;
            time_t time2 = (time_t)(now / 3600 / 24) * 3600 * 24;
            
            for(i = 0; i < 24; i++) { 
                data.data_day[i].data = (float)lv_rand(500, 600);
                data.data_day[i].timestamp = time1 + i *3600;
                data.data_day[i].valid = true;
                if( min > data.data_day[i].data) {
                    min = data.data_day[i].data;
                }
                if( max < data.data_day[i].data) {
                    max = data.data_day[i].data;
                }
            }
            data.day_max = max;
            data.day_min = min;

            min=700;
            max=0;
            for(i = 0; i < 7; i++) { 
                data.data_week[i].min = (float)lv_rand(500, 600);
                data.data_week[i].max = (float)lv_rand(600, 700);
                data.data_week[i].timestamp =  time2 + i * 3600 * 24;;
                data.data_week[i].valid = true;
                if( min > data.data_week[i].min) {
                    min = data.data_week[i].min;
                }
                if( max < data.data_week[i].max) {
                    max = data.data_week[i].max;
                }
            }
            data.week_max = max;
            data.week_min = min;
            esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_DATA_HISTORY, &data, sizeof(struct view_data_sensor_history_data ), portMAX_DELAY);
            break;
        }
#endif

    default:
        break;
    }
}

