hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
int indicator_sensor_init(void)
{
    __g_data_mutex  =  xSemaphoreCreateMutex();

    updata_queue_handle = xQueueCreate(5*2, sizeof( struct updata_queue_msg));

    __sensor_history_data_restore();
    
    __sensor_history_data_update_init();

    xTaskCreate(esp32_rp2040_comm_task, "esp32_rp2040_comm_task", ESP32_RP2040_COMM_TASK_STACK_SIZE, NULL, 2, NULL);

    xTaskCreate(sensor_history_data_updata_task, "sensor_history_data_updata_task", 1024*4, NULL, 6, NULL);

    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_TEMP_HISTORY, 
                                                            __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_HUMIDITY_HISTORY, 
                                                            __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_TVOC_HISTORY, 
                                                            __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_CO2_HISTORY, 
                                                            __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENSOR_PA_HISTORY, 
                                                            __view_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SHUTDOWN, 
                                                            __view_event_handler, NULL, NULL));
#if 0
    ESP_ERROR_CHECK(esp_event_handler_instance_register_with(view_event_handle, 
                                                            VIEW_EVENT_BASE, VIEW_EVENT_SENDMAIL, 
                                                            __view_event_handler, NULL, NULL));
#endif
}

